{
    "modelTopology":{
        "className":"Sequential",
        "config":{
            "name":"sequential_4",
            "layers":[{
                "className":"Dense",
                "config":{
                    "units":100,
                    "activation":"relu",
                    "use_bias":true,
                    "kernel_initializer":{
                        "className":"VarianceScaling",
                        "config":{
                            "scale":1,
                            "mode":"fan_in",
                            "distribution":"normal",
                            "seed": null
                        }
                    },
                    "bias_initializer":{
                        "className":"Zeros",
                        "config":{}
                    },
                    "kernel_regularizer":null,
                    "bias_regularizer":null,
                    "activity_regularizer":null,
                    "kernel_constraint":null,
                    "bias_constraint":null,
                    "name":"dense_Dense3",
                    "trainable":true,
                    "batch_input_shape":[null,14739],
                    "dtype":"float32"
                }
            },
            {
                "className":"Dropout",
                "config":{
                    "rate":0.5,
                    "noise_shape":null,
                    "seed":null,
                    "name":"dropout_Dropout2",
                    "trainable":true
                }
            },
            {
                "className":"Dense",
                "config":{
                    "units":3,
                    "activation":"softmax",
                    "use_bias":false,
                    "kernel_initializer":{
                        "className":"VarianceScaling",
                        "config":{
                            "scale":1,
                            "mode":"fan_in",
                            "d istribution":"normal",
                            "seed":null
                        }
                    },
                    "bias_initializer":{
                        "className":"Zeros",
                        "config":{}
                    },
                    "kernel_regularizer":null,
                    "bias_regularizer":null,
                    "activity_regularizer":null,
                    "kernel_constraint":null,
                    "bias_constraint":null,
                    "name":"dense_Dense4",
                    "trainable":true
                }
            }]
        },
        "keras_version":"tfjs-layers 1.3.1",
        "backend":"tensor_flow.js"
    },
    "format":"layers-model",
    "generatedBy":"TensorFlow.js tfjs-layers v1.3.1",
    "convertedBy":null,
    "weightsManifest":[{
        "paths":["./model.weights.bin"],
        "weights":[{"name":"dense_Dense3/kernel","shape":[14739,100],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[100,3],"dtype":"float32"}]
    }]
}